///// DB에 저장이 되는 항목인 경우 CMB_CONST_XXXXX 의 형태로 CONST를 붙임.

CMB_SRC_SLAB_SAHPE_FULL_T                     = "T"
CMB_SRC_SLAB_SAHPE_HALF_T                     = "Half T"

CMB_SRC_SHEAR_CON_TYPE_STUD                   = "Stud"
CMB_SRC_SHEAR_CON_TYPE_CHNL                   = "Channel"

CMB_UCCB_USETYPE_OFFICE                       = "Office"
CMB_UCCB_USETYPE_RESIDE                       = "Residence"
CMB_UCCB_USETYPE_CHURCH                       = "Church"
CMB_UCCB_USETYPE_SHOP                         = "Shopping Mall"
CMB_UCCB_USETYPE_BRG_IN                       = "Foot Bridge ( Indoor )"
CMB_UCCB_USETYPE_BRG_OU                       = "Foot Bridge ( Outdoor )"
CMB_UCCB_POSITION_INT                         = "Interior"
CMB_UCCB_POSITION_EDG                         = "Edge"
CMB_UCCB_CONNTYPE_FIX                         = "Moment Connection"
CMB_UCCB_CONNTYPE_PIN                         = "Shear Connection"

CMB_UCCO_LOAD_TR_FORC_STL                     = "Steel Only"
CMB_UCCO_LOAD_TR_FORC_CONC                    = "Concrete Only"
CMB_UCCO_LOAD_TR_FORC_BOTH                    = "Both"
CMB_UCCO_MBAR_TYPE_CORNER_AUTO                = "Corner ( Auto )"
CMB_UCCO_MBAR_TYPE_CORNER_USER                = "Corner ( User )"
CMB_UCCO_MBAR_TYPE_EQUAL_SPACE                = "Equally Space"

CMB_UCFT_LOAD_TR_SIDE_ONE                     = "One Side"
CMB_UCFT_LOAD_TR_SIDE_BOTH                    = "Both Side"
CMB_UCFT_LOAD_TR_FORC_STL                     = "Steel Only"
CMB_UCFT_LOAD_TR_FORC_CONC                    = "Concrete Only"
CMB_UCFT_LOAD_TR_FORC_BOTH                    = "Both"

CMB_UCFT_SEISMIC_DUCTILITY_HIGH               = "High"
CMB_UCFT_SEISMIC_DUCTILITY_MIDD               = "Middle"

